[
  {
    "title": "Elmbridge sets out plans to invest £1 million of Shared Prosperity Fund",
    "slug": "/elmbridge-sets-out-plans-to-invest-1-million-of-shared-prosperity-fund/",
    "content": "<!-- wp:paragraph -->\n<p>As part of the levelling-up agenda, the government has made available £1 Million Pounds to Elmbridge through the UK Shared Prosperity Fund. This week the council have presented plans for how the money will be spent across the Borough.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Councillor Robin Stephens</strong>, Portfolio Holder for Economy and Local Enterprise, said:</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>“We are excited to present to the Government our plans for the Shared Prosperity Fund which include help to support plans to relaunch the Walton Playhouse and playgrounds across the borough. We want to work with our community locally to target support, invest in our community facilities, back our high streets and help our businesses reduce their costs and carbon footprint.”</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Liberal Democrats are committed to improving wet and dry play spaces for children in Elmbridge. Plans include funds for Claygate &amp; Hurst Pools as well as focusing on new options in Weybridge, Hersham, West Molesey, Grovelands and around the rest of the Borough.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>A significant element of the Shared prosperity fund will be focused on supporting local business and our high streets as the hearts of our towns and villages.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Bruce McDonald</strong>, leader of Elmbridge Liberal Democrats, “The Council will be working with local community groups to ensure the funds are spent in a way which has the biggest impact for our residents. Over the 3 years the fund is available we want residents to see a real change”</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The Liberal Democrats are working hard to make Elmbridge the very best place to live and work in the country.</p>\n<!-- /wp:paragraph -->",
    "excerpt": "As part of the levelling-up agenda, the government has made available £1 Million Pounds to Elmbridge through the UK Shar...",
    "date": "7:44 4-8-2022",
    "featuredImageURL": "https://elmbridgelibdems.org.uk/wp-content/uploads/2022/08/1million-shared-prosperity.jpg"
  }
]